In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style("whitegrid")

The libraries were sucessfully imported, which ensures that i have the required tools to perform data cleaning, analyzing, manipulation and visualization.

In this step, I load the datasets of both files using pandas, Here pandas provide us with the read.csv() function which allow us to import the csv files.

In [2]:
edgap = pd.read_excel(
    "C:/Users/SRAVYASRI/Downloads/DATA 5100_Foundations of data science/Education/data/EdGap_data.xlsx",
    dtype={'NCESSCH School ID': object}
)

C:\Users\SRAVYASRI\anaconda3\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [3]:
School_information = pd.read_csv("https://www.dropbox.com/s/lkl5nvcdmwyoban/ccd_sch_029_1617_w_1a_11212017.csv?dl=1", encoding='unicode_escape',low_memory= False)

Both files load without errors. The School_information file uses a special encoding because it has a lot of text, and its size is handled by setting low_memory=False.

In [4]:
pd.set_option('display.max_columns', None)

In [5]:
Scl_expenditures = pd.read_csv(
    "C:/Users/SRAVYASRI/Documents/Data_5100/SCH/CRDC/CSV/School Expenditures.csv",encoding='unicode_escape',low_memory= False
)

In [6]:
support_scl = pd.read_csv(
    "C:/Users/SRAVYASRI/Documents/Data_5100/SCH/CRDC/CSV/School Support.csv",encoding='unicode_escape',low_memory= False
)

Here we are exploring the dataset with head, This function gives the number of columns to getan overview about what were present in the dataset.

Here we can see what was present in the dataset, when we just give head() function, it defaults to displaying the first 5 observations as we can see the school id, unemployment rate, ACT scores, and the school level, zipcode and so on.

Here the display max columsn shows all the columns present in the data rather than show dots.

Here we can clearly see all the columns that were present in the School_information dataframe.

Here the info() function gives the information such as column names, datatypes, memory usage and the information about NAN(Not a number) values.

Here we can observe that the School_information dataframe is larger than the edgap dataframe, and the memory usage for School_information is also more.

Here we check for the columns in each dataset, Here the column attribute give the names of all the columns that were present in the dataset.

In [7]:
School_information=School_information[['SCHOOL_YEAR','NCESSCH', 'LSTATE', 'LZIP','SCH_TYPE_TEXT', 'LEVEL','CHARTER_TEXT']]

In [8]:
edgap = edgap.rename(
    columns={
        "NCESSCH School ID": "id",
        "CT Pct Adults with College Degree": "percent_college",
        "CT Unemployment Rate": "rate_unemployment",
        "CT Pct Childre In Married Couple Family": "percent_married",
        "CT Median Household Income": "median_income",
        "School ACT average (or equivalent if SAT score)": "average_act",
        "School Pct Free and Reduced Lunch": "percent_lunch"
    }
)

In [9]:
School_information = School_information.rename(
    columns={
        "SCHOOL_YEAR": "year",
        "NCESSCH": "id",
        "LSTATE": "state",
        "LZIP": "zip_code",
        "SCH_TYPE_TEXT": "school_type",
        "LEVEL": "school_level",
        "CHARTER_TEXT": "charter"
    }
)

In [11]:
Scl_expenditures.columns

Index(['LEA_STATE', 'LEA_STATE_NAME', 'LEAID', 'LEA_NAME', 'SCHID', 'SCH_NAME',
       'COMBOKEY', 'JJ', 'SCH_SAL_TOTPERS_WOFED', 'SCH_FTE_TEACH_WOFED',
       'SCH_SAL_TEACH_WOFED', 'SCH_NPE_WOFED', 'SCH_FTE_AID_WOFED',
       'SCH_SAL_AID_WOFED', 'SCH_FTE_SUP_WOFED', 'SCH_SAL_SUP_WOFED',
       'SCH_FTE_ADM_WOFED', 'SCH_SAL_ADM_WOFED', 'SCH_SAL_TEACH_WFED',
       'SCH_FTE_AID_WFED', 'SCH_SAL_AID_WFED', 'SCH_FTE_SUP_WFED',
       'SCH_SAL_SUP_WFED', 'SCH_FTE_ADM_WFED', 'SCH_SAL_ADM_WFED',
       'SCH_SAL_TOTPERS_WFED', 'SCH_NPE_WFED'],
      dtype='object')

In [12]:
Scl_expenditures=Scl_expenditures[['COMBOKEY','SCHID','SCH_NAME','SCH_SAL_TOTPERS_WOFED','SCH_NPE_WOFED','SCH_SAL_TOTPERS_WFED']]

In [13]:
Scl_expenditures = Scl_expenditures.rename(
    columns={
    'COMBOKEY':'id',
    'SCHID':'school_code',
    'SCH_NAME':'school name',
   'SCH_SAL_TOTPERS_WOFED':'Tot_salary_exp',
    'SCH_NPE_WOFED':'Non_personal_exp', 
    'SCH_SAL_TOTPERS_WFED': 'Tot_salary_exp_federal'})

In [18]:
support_scl.columns
support_scl=support_scl[['COMBOKEY','SCH_FTETEACH_TOT']]

In [20]:
support_scl = support_scl.rename(
    columns={
        'SCH_FTETEACH_TOT':'Tot_FTE_teachers',
        'COMBOKEY': 'id'})

             id  Tot_FTE_teachers
0  010000201705              25.0
1  010000201706              16.0
2  010000201876              11.0

In [46]:

School_information['id']=School_information['id'].astype(str).str.replace(r'^\.0', '', regex=True)

In [47]:
edgap.head()

,id,rate_unemployment,percent_college,percent_married,median_income,average_act,percent_lunch
0,100001600143,0.117962,0.445283,0.346495,42820.0,20.433455,0.066901
1,100008000024,0.063984,0.662765,0.767619,89320.0,19.498168,0.112412
2,100008000225,0.056460,0.701864,0.713090,84140.0,19.554335,0.096816
3,100017000029,0.044739,0.692062,0.641283,56500.0,17.737485,0.296960
4,100018000040,0.077014,0.640060,0.834402,54015.0,18.245421,0.262641

In [48]:

School_information.info

<bound method DataFrame.info of              year              id state zip_code         school_type  \
0       2016-2017   10000200277.0    AL    35220  Alternative School
1       2016-2017   10000201667.0    AL    36067  Alternative School
2       2016-2017   10000201670.0    AL    36784  Alternative School
3       2016-2017   10000201705.0    AL    36057  Alternative School
4       2016-2017   10000201706.0    AL    35206  Alternative School
...           ...             ...   ...      ...                 ...
102178  2016-2017  780003000025.0    VI    00802      Regular School
102179  2016-2017  780003000026.0    VI    00802      Regular School
102180  2016-2017  780003000027.0    VI    00802      Regular School
102181  2016-2017  780003000033.0    VI    00804      Regular School
102182  2016-2017  780003000034.0    VI    00802      Regular School

       school_level         charter
0              High              No
1              High              No
2              High              No
3              High              No
4              High              No
...             ...             ...
102178   Elementary  Not applicable
102179   Elementary  Not applicable
102180   Elementary  Not applicable
102181       Middle  Not applicable
102182       Middle  Not applicable

[102183 rows x 7 columns]>

In [28]:
support_scl['id']=support_scl['id'].str.lstrip('0')
Scl_expenditures['id']=Scl_expenditures['id'].str.lstrip('0')

In [29]:

Scl_expenditures.head()

,id,school_code,school name,Tot_salary_exp,Non_personal_exp,Tot_salary_exp_federal
0,10000201705,1705,Wallace Sch - Mt Meigs Campus,1908676.0,102500.00,1908676.00
1,10000201706,1706,McNeel Sch - Vacca Campus,1563570.0,30502.00,1305463.00
2,10000201876,1876,Alabama Youth Services,3998276.0,341426.00,5122976.00
3,10000299995,99995,AUTAUGA CAMPUS,305220.0,18700.00,386551.00
4,10000500870,870,Albertville Middle School,2394774.5,566767.07,2782657.92

In [30]:
support_scl.head()

            id  Tot_FTE_teachers
0  10000201705             25.00
1  10000201706             16.00
2  10000201876             11.00
3  10000299995              3.00
4  10000500870             39.29

In [41]:
df=School_information.merge(
    support_scl,
    how='left',
    on='id'
    )

In [42]:
df.head()

,year,id,state,zip_code,school_type,school_level,charter,Tot_FTE_teachers
0,2016-2017,10000200277.0,AL,35220,Alternative School,High,No,NaN
1,2016-2017,10000201667.0,AL,36067,Alternative School,High,No,NaN
2,2016-2017,10000201670.0,AL,36784,Alternative School,High,No,NaN
3,2016-2017,10000201705.0,AL,36057,Alternative School,High,No,NaN
4,2016-2017,10000201706.0,AL,35206,Alternative School,High,No,NaN

In [43]:
df.isna().sum().to_frame(name="Number of Missing Values")

                  Number of Missing Values
year                                     0
id                                       0
state                                    0
zip_code                                 0
school_type                              2
school_level                             4
charter                                  4
Tot_FTE_teachers                    102183